[{"name":"5 &bull; HTP Supreme&trade; 60 Capsules","description":"5  HTP Supreme is a synergistic formula of 5-hydroxytryptophan (100 mg) and vitamin B6 (20 mg) for supporting overall neurotransmitter metabolism by providing precursors of serotonin. 5-HTP readily enters the blood brain barrier, however conversion into serotonin requires the cofactor vitamin B6, which is included in this formula. 5  HTP Supreme may be used during the day to support healthy mood or appetite or at bedtime to support sleep.This formula is used in place of 5  HTP Synergy when higher doses of 5-HTP are required."},{"name":"5 &bull; HTP Synergy&trade; 90 vegetarian capsules","description":"5  HTP Synergy is a synergistic formula of 5-hydroxytryptophan (50 mg) and vitamin B6 (10 mg) for supporting overall neurotransmitter metabolism by providing precursors of serotonin. 5-HTP readily enters the blood brain barrier, however conversion into serotonin requires the cofactor vitamin B6, which is included in this formula. 5  HTP Synergy may be used during the day to support healthy mood or appetite or at bedtime to support sleep."},{"name":"7-Keto&reg; 60 capsules","description":"7-Keto is a registered trade name for the compound  3-acetyl-7-oxo DHEA, a stabilized form of 7-oxo DHEA. Once ingested,  acetyl-7-oxo DHEA is cleaved to 7-oxo DHEA, a DHEA metabolite naturally found  in the body. Although 7-oxo DHEA is similar  to DHEA, it does not convert into estrogenic or androgenic hormones."},{"name":"Detox 14 Day Detox Program (with Unflavored PurePea&trade;)","description":null},{"name":"14 Day Detox Program (with Vanilla PurePea&trade;)","description":null},{"name":"OcuForce&trade; 60 vegetarian capsules","description":null},{"name":"Oil of Oregano 150 mg 60 softgels","description":"Oil of Oregano has highly effective antimicrobial properties as well as powerful antioxidant and intestinal cleansing benefits. The formula contains a 10:1 extract, which is the equivalent of 1,500 mg of oregano."},{"name":"Oil of Oregano 150 mg, 120 softgels","description":"Oil of Oregano has highly effective antimicrobial properties as well as powerful antioxidant and intestinal cleansing benefits. The formula contains a 10:1 extract, which is the equivalent of 1,500 mg of oregano."},{"name":"Olive Leaf Extract 500mg 90 vegetarian capsules","description":"Olive Leaf Extract contains significant quantities of phenolic compounds, such as oleuropein and hydroxytyrosol that have been shown to have antimicrobial properties, antioxidant power, and have the ability to support phagocytosis. It can also be used to support the health of the cardiovascular system."},{"name":"OmegAvail&trade; Hi-Po 60 softgels","description":null},{"name":"OmegAvail&trade; Lemon Drop Smoothie 8 oz.","description":"Each 2 teaspoon serving is packed with 1100mg of EPA and 720mg DHA (a total of 1820mg) and is manufactured using a proprietary emulsification technology that significantly reduces the size of fish oil molecules, resulting in enhanced absorption. This formula is ideal for children and those who do not prefer to swallow softgels. Only Designs for Health fish oil products carry the TruTG seal, which are delivered in the form found in nature and are of superior TG potency. The TruTG seal guarantees a minimum 90% triglyceride-bound (TG) omega-3 fish oils, a level that is 40% - 50% higher than the industry standard for most TG fish oil concentrate products.As always, our fish oils are molecularly distilled and filtered to ensure purity and to maximize the removal of heavy metals, pesticides, solvents, PCBs, and other contaminants."},{"name":"OmegAvail&trade; Lemon Drop Smoothie 16 oz.","description":"Each 2 teaspoon serving is packed with 1100mg of EPA and 720mg DHA (a total of 1820mg) and is manufactured using a proprietary emulsification technology that significantly reduces the size of fish oil molecules, resulting in enhanced absorption. This formula is ideal for children and those who do not prefer to swallow softgels. Only Designs for Health fish oil products carry the TruTG seal, which are delivered in the form found in nature and are of superior TG potency. The TruTG seal guarantees a minimum 90% triglyceride-bound (TG) omega-3 fish oils, a level that is 40% - 50% higher than the industry standard for most TG fish oil concentrate products.As always, our fish oils are molecularly distilled and filtered to ensure purity and to maximize the removal of heavy metals, pesticides, solvents, PCBs, and other contaminants."},{"name":"OmegAvail&trade; Liquid 8oz.","description":"OmegAvail Liquid is a viable option for patients who prefer to swallow fewer capsules and for those requiring high doses. Only Designs for Health fish oil products carry the TruTG seal, which are delivered in the form found in nature and are of superior TG potency. The TruTG seal guarantees a minimum 90% triglyceride-bound (TG) omega-3 fish oils, a level that is 40% - 50% higher than the industry standard for most TG fish oil concentrate products.As always, our fish oils are molecularly distilled and filtered to ensure purity and to maximize the removal of heavy metals, pesticides, solvents, PCBs, and other contaminants."},{"name":"OmegAvail&trade; Marine with Lipase 120 softgels","description":"OmegAvail Marine is an ideal fish oil product for maintenance and general Omega-3 dosing, along with lipase for enhanced digestion and absorption. Only Designs for Health fish oil products carry the TruTG seal, which are delivered in the form found in nature and are of superior TG potency. The TruTG seal guarantees a minimum 90% triglyceride-bound (TG) omega-3 fish oils, a level that is 40% - 50% higher than the industry standard for most TG fish oil concentrate products.As always, our fish oils are molecularly distilled and filtered to ensure purity and to maximize the removal of heavy metals, pesticides, solvents, PCBs, and other contaminants."},{"name":"OmegAvail&trade; Synergy 60 softgels","description":null},{"name":"OmegAvail&trade; Synergy 180 softgels","description":"This unique omega 3-6-7-9 formula contains a blend of wild deep-sea sourced fish oils containing the omega-3 fats (EPA\/DHA) in the TruTG form, the most important omega-6 fat (GLA from borage oil), the omega-7 fat palmitoleic acid and omega-9 fat oleic acid from certified virgin organic macadamia nut oil. EPA helps keep GLA metabolism in an anti-inflammatory mode.  In addition, docosahexaenoic acid (DHA) plays as many important roles in human health as EPA, along with promoting brain wellness.Designs for Health fish oil products carry the TruTG seal, which are delivered in the form found in nature and are of superior TG potency. The TruTG seal guarantees a minimum 90% triglyceride-bound (TG) omega-3 fish oils, a level that is 40% - 50% higher than the industry standard for most TG fish oil concentrate products.As always, our fish oils are molecularly distilled and filtered to ensure purity and to maximize the removal of heavy metals, pesticides, solvents, PCBs, and other contaminants."},{"name":"OmegAvail&trade; Ultra 120 softgels","description":"OmegAvail Ultra (formerly OmegAvail Ultra TG) still provides the same levels of omega-3 fatty acids per serving. The only change  we&#039;ve enhanced this product with the addition of lipase, a digestive aid to ensure maximum absorption.Designs for Health fish oil products carry the TruTG seal, which are delivered in the form found in nature and are of superior TG potency. The TruTG seal guarantees a minimum 90% triglyceride-bound (TG) omega-3 fish oils, a level that is 40% - 50% higher than the industry standard for most TG fish oil concentrate products.As always, our fish oils are molecularly distilled and filtered to ensure purity and to maximize the removal of heavy metals, pesticides, solvents, PCBs, and other contaminants."},{"name":"OmegAvail&trade; Ultra 240 softgels","description":"OmegAvail Ultra (formerly OmegAvail Ultra TG) still provides the same levels of omega-3 fatty acids per serving. The only change  we&#039;ve enhanced this product with the addition of lipase, a digestive aid to ensure maximum absorption.Designs for Health fish oil products carry the TruTG seal, which are delivered in the form found in nature and are of superior TG potency. The TruTG seal guarantees a minimum 90% triglyceride-bound (TG) omega-3 fish oils, a level that is 40% - 50% higher than the industry standard for most TG fish oil concentrate products.As always, our fish oils are molecularly distilled and filtered to ensure purity and to maximize the removal of heavy metals, pesticides, solvents, PCBs, and other contaminants."},{"name":"OmegAvail&trade; Ultra with Vitamin D3, K1 &amp; K2 120 softgels","description":"A breakthrough fish oil product using the same high potency omega-3 oil found in our OmegAvail Ultra TG softgel, with the enhanced benefit of the fat soluble vitamins D and K, plus lipase for enhanced digestion and absorption.Only Designs for Health fish oil products carry the TruTG seal, which are delivered in the form found in nature and are of superior TG potency. The TruTG seal guarantees a minimum 90% triglyceride-bound (TG) omega-3 fish oils, a level that is 40% - 50% higher than the industry standard for most TG fish oil concentrate products.As always, our fish oils are molecularly distilled and filtered to ensure purity and to maximize the removal of heavy metals, pesticides, solvents, PCBs, and other contaminants."},{"name":"OmegAvail&trade; Ultra DHA","description":"OmegAvail Ultra DHAcontains highly concentrated DHA (docosahexaenoic acid) from fish oil in its natural TG (triglyceride) form. As with all Designs for Health TruTG fish oil products, OmegAvail Ultra DHA is comprised of a minimum 90% natural TG-bound omega-3 oils. Each softgel provides 500 mg DHA + 110 mg EPA for optimal DHA status. As always, our fish oils are molecularly distilled and filtered to ensure purity and to maximize the removal of heavy metals, pesticides, solvents, PCBs, and other contaminants."},{"name":"Organic RYR","description":"Red yeast rice is the product of yeast (Monascus purpureus) containing several compounds collectively known as monacolins, substances that have been shown by clinical studies to support healthy blood lipids.The red yeast rice in Organic RYR is USDA certified organic and grown in the US. Designs for Health takes great care to assay our red yeast rice to assure that there are undetectable levels of citrinin, as well as substantial levels of naturally-occurring monacolin compounds, especially monacolin K.Organic RYR may support the health of the arterial lining and help reduce oxidative stress and inflammation."},{"name":"Osteoben&trade;","description":"Osteoben is formulated to address the pathophysiology of osteopenia and osteoporosis, providing patients with the proper bone-supportive nutritional requirements in order to safely assist with the dietary management of these conditions. The main active compound of Osteoben is the isoflavone genistein, which works to target the decreased BMD (bone mineral density) seen in osteopenia and osteoporosis."},{"name":"OsteoForce&trade; 120 Tablets","description":"OsteoForce contains bone-supportive nutrients in their most absorbable forms. The minerals  calcium, magnesium, zinc, copper, manganese, potassium and boron  are from Albion Advanced Nutrition, the leader in formulating truly chelated minerals with outstanding absorption and bioavailability. True chelates are not only absorbed better than mineral salts, but they are retained better in body tissues (such as bone). Take this product with Twice Daily Multi for best results."},{"name":"OsteoForce&trade; 240 Tablets","description":"OsteoForce contains bone-supportive nutrients in their most absorbable forms. The minerals  calcium, magnesium, zinc, copper, manganese, potassium and boron  are from Albion Advanced Nutrition, the leader in formulating truly chelated minerals with outstanding absorption and bioavailability. True chelates are not only absorbed better than mineral salts, but they are retained better in body tissues (such as bone). Take this product with Twice Daily Multi for best results."},{"name":"OsteoForce&trade; Supreme, 180 capsules","description":"OsteoForce Supreme features the identical comprehensive array of bone-supportive nutrients found in our standard OsteoForce, with the addition of vitamin K2 and the protein MBP (Milk Basic Protein) along with an increased level of vitamin D (2000 IU). MBP is a multifunctional, natural protein present in trace amounts in human and bovine milk whose main role is to assist the body in its ability to support healthy bone density. MBP is derived from the whey portion of milk protein, which is often well-tolerated, even by those with allergies\/sensitivities to lactose or casein. Those with allergies or sensitivities to whey may want to support their bone health with our standard OsteoForce."},{"name":"P-5-P 50 mg 120 capsules","description":"Vitamin B6 is found in three forms  pyridoxine hydrochloride, pyridoxal, and pyridoxamine  all of which must be converted into activated pyridoxal-5-phosphate (P-5-P) by the liver. P-5-P is the form of vitamin B6 the body ultimately uses and is necessary for a wide range of actions, including the production of GABA, the conversion of 5-HTP to serotonin, and also in the decarboxylation of L-Dopa to dopamine. It is also needed for glucose production as well as amino acid and lipid metabolism.*"},{"name":"PaleoBar&trade; Chocolate Flavor Coated Bar - Case of 18","description":"PaleoBars are delicious nutrition bars designed to provide a healthy snack food for optimizing the intake of proteins, fats, carbohydrates, and micronutrients. They contain no artificial sweeteners, but include natural ones such as xylitol, maltitol, and erythritol. All PaleoBars are Kosher certified and free of gluten, fructose, sucrose, soy protein, and hydrogenated oils. PaleoBar Chocolate Coated has a protein base of whey\/rice protein concentrate and features omega-3 fish oils. This bar also contains prebiotic fiber and additional healthy fats from almond butter and coconut oil."},{"name":"PaleoBar&trade;  Mixed Berry Bar - Case of 18","description":"PaleoBars are delicious nutrition bars designed to provide a healthy snack food for optimizing the intake of proteins, fats, carbohydrates, and micronutrients. They contain no artificial sweeteners, but include natural ones such as xylitol, maltitol, and erythritol. All PaleoBars are Kosher certified and free of gluten, fructose, sucrose, soy protein, and hydrogenated oils.PaleoBar Mixed Berry has a protein base of whey\/rice protein concentrate and healthy fats from almond butter and coconut oil. This bar contains potent freeze-dried strawberry and blueberry extracts along with white tea, apple and rosemary extracts, all of which contribute to a high antioxidant value measured at 6,000 ORAC units."},{"name":"PaleoBar&trade; Vanilla\/Almond Coated Bar - Case of 18","description":"PaleoBars are delicious nutrition bars designed to provide a healthy snack food for optimizing the intake of proteins, fats, carbohydrates, and micronutrients. They contain no artificial sweeteners, but include natural ones such as xylitol, maltitol, and erythritol. All PaleoBars are Kosher certified and free of gluten, fructose, sucrose, soy protein, and hydrogenated oils.PaleoBar Vanilla\/Almond Coated has a protein base of whey\/rice protein concentrate and features omega-3 fish oils. This bar also contains prebiotic fiber and additional healthy fats from almond butter and coconut oil."},{"name":"PaleoBar&trade;-DF Chocolate\/Almond Anabolic Energy Bar - Case of 18","description":"PaleoBars are delicious nutrition bars designed to provide a healthy snack food for optimizing the intake of proteins, fats, carbohydrates, and micronutrients. They contain no artificial sweeteners, but include natural ones such as xylitol, maltitol, and erythritol. All PaleoBars are Kosher certified and free of gluten, fructose, sucrose, soy protein, and hydrogenated oils.PaleoBar-DF Chocolate\/Almond is an anabolic energy bar great for energy and post-workout recovery, and features creatine, magnesium and L-carnitine. This bar is dairy-free with a protein base from rice protein concentrate and pea protein isolate and healthy fats from almond butter and coconut oil."},{"name":"PaleoBar&trade;-DF Coconut\/Almond Crave Control Bar - Case of 18","description":"PaleoBars are delicious nutrition bars designed to provide a healthy snack food for optimizing the intake of proteins, fats, carbohydrates, and micronutrients. They contain no artificial sweeteners, but include natural ones such as xylitol, maltitol, and erythritol. All PaleoBars are Kosher certified and free of gluten, fructose, sucrose, soy protein, and hydrogenated oils.PaleoBar-DF Coconut\/Almond is a crave control bar to help curb carbohydate cravings, featuring Alpha Lipoic Acid and chromium. This bar is dairy-free with a protein base from rice protein concentrate and pea protein isolate and healthy fats from almond butter and coconut oil."},{"name":"PaleoCleanse&trade; 756 gm Powder","description":"PaleoCleanse contains a natural pea protein isolate to fuel natural detoxification pathways. It includes the nutrients needed to support and balance phase I and II metabolic pathways, high levels of antioxidants for safe detoxification and a comprehensive array of herbal hepatics and cholagogues to promote healthy liver function and elimination.*"},{"name":"PaleoFiber&trade; 300g Berry Flavored  powder","description":"PaleoFiber is the ultimate fiber product. It is a comprehensive product that contains 12 different types of fiber and none of the allergenic proteins or harsh, irritating components commonly found in other fiber products on the market. This product was designed with the features of the Paleolithic diet in mind, with which human physiology may be most adapted. PaleoFiber could be a useful tool to help support proper weight management, glucose levels, and lipid levels."},{"name":"PaleoFiber&trade; 300g Unflavored powder","description":"PaleoFiber is the ultimate fiber product. It is a comprehensive product that contains 12 different types of fiber and none of the allergenic proteins or harsh, irritating components commonly found in other fiber products on the market. This product was designed with the features of the Paleolithic diet in mind, with which human physiology may be most adapted. PaleoFiber could be a useful tool to help support proper weight management, glucose levels, and lipid levels."},{"name":"PaleoGreens&trade; Organic 270g powder - Lemon\/Lime flavor","description":"PaleoGreens is the great tasting Designs for Health greens food made with over 90% organic ingredients. The vegetable, fruit, and berry ingredients are brightly colored and non-oxidized, as the powders are protected from heat, UV light and moisture from start to finish. These greens have a Paleo profile; they contain no grains, legumes, alfalfa, corn, gluten, fructose or artificial sweeteners. Unlike other greens products, we never add inexpensive fillers or bulking agents such as fiber, whole grasses, pectin, rice bran, and\/or flax, which account for 40% to 60% of the content of most other greens products. We work closely with our certified organic growers to ensure the optimal preservation of enzymes and beneficial phytonutrients in PaleoGreens ingredients. These ingredients are harvested at their peak of potency and immediately concentrated and dried by utilizing proprietary cool-temperature processes that preserve their energetic and nutritional integrity."},{"name":"PaleoGreens&trade; Organic 270g powder - Mint Flavor","description":"PaleoGreens is the great tasting Designs for Health greens food made with over 90% organic ingredients. The vegetable, fruit, and berry ingredients are brightly colored and non-oxidized, as the powders are protected from heat, UV light and moisture from start to finish. These greens have a Paleo profile; they contain no grains, legumes, alfalfa, corn, gluten, fructose or artificial sweeteners. Unlike other greens products, we never add inexpensive fillers or bulking agents such as fiber, whole grasses, pectin, rice bran, and\/or flax, which account for 40% to 60% of the content of most other greens products. We work closely with our certified organic growers to ensure the optimal preservation of enzymes and beneficial phytonutrients in PaleoGreens ingredients. These ingredients are harvested at their peak of potency and immediately concentrated and dried by utilizing proprietary cool-temperature processes that preserve their energetic and nutritional integrity."},{"name":"PaleoGreens&trade; Organic powder  270g - Unflavored","description":"PaleoGreens is the great tasting Designs for Health greens food made with over 90% organic ingredients. The vegetable, fruit, and berry ingredients are brightly colored and non-oxidized, as the powders are protected from heat, UV light and moisture from start to finish. These greens have a Paleo profile; they contain no grains, legumes, alfalfa, corn, gluten, fructose or artificial sweeteners. Unlike other greens products, we never add inexpensive fillers or bulking agents such as fiber, whole grasses, pectin, rice bran, and\/or flax, which account for 40% to 60% of the content of most other greens products. We work closely with our certified organic growers to ensure the optimal preservation of enzymes and beneficial phytonutrients in PaleoGreens ingredients. These ingredients are harvested at their peak of potency and immediately concentrated and dried by utilizing proprietary cool-temperature processes that preserve their energetic and nutritional integrity."},{"name":"PaleoMeal&reg; Chocolate Powder 540g","description":"PaleoMeal is a great-tasting, nutrient-rich powdered meal supplement designed to help promote an optimal intake of protein, fats, carbohydrates, vitamins and minerals needed for overall wellness. The ingredients make this formula ideal for patients needing support with weight control, GI health, detoxification, immune issues, heavy metals, and muscle gain.PaleoMeal is made with Proserum, exceptional quality, native whey protein concentrate. This whey is produced using minimal processing, and maintains the full range of all the fragile immune-boosting and regenerative components naturally present in fresh raw milk. It comes from cows that graze on pesticide-free, chemical-free natural grass pastures, and which are never given hormones, genetically modified organisms, or injected pathogens. The result is the highest quality protein supplement, rich in immunoglobulins and lactoferrin, and free of artificial flavors and sweeteners."},{"name":"PaleoMeal&reg; Chocolate 900 grams","description":"PaleoMeal is a great-tasting, nutrient-rich powdered meal supplement designed to help promote an optimal intake of protein, fats, carbohydrates, vitamins and minerals needed for overall wellness. The ingredients make this formula ideal for patients needing support with weight control, GI health, detoxification, immune issues, heavy metals, and muscle gain.PaleoMeal is made with Proserum, exceptional quality, native whey protein concentrate. This whey is produced using minimal processing, and maintains the full range of all the fragile immune-boosting and regenerative components naturally present in fresh raw milk. It comes from cows that graze on pesticide-free, chemical-free natural grass pastures, and which are never given hormones, genetically modified organisms, or injected pathogens. The result is the highest quality protein supplement, rich in immunoglobulins and lactoferrin, and free of artificial flavors and sweeteners."},{"name":"PaleoMeal&reg; Strawberry 540 grams","description":"PaleoMeal is a great-tasting, nutrient-rich powdered meal supplement designed to help promote an optimal intake of protein, fats, carbohydrates, vitamins and minerals needed for overall wellness. The ingredients make this formula ideal for patients needing support with weight control, GI health, detoxification, immune issues, heavy metals, and muscle gain.PaleoMeal is made with Proserum, exceptional quality, native whey protein concentrate. This whey is produced using minimal processing, and maintains the full range of all the fragile immune-boosting and regenerative components naturally present in fresh raw milk. It comes from cows that graze on pesticide-free, chemical-free natural grass pastures, and which are never given hormones, genetically modified organisms, or injected pathogens. The result is the highest quality protein supplement, rich in immunoglobulins and lactoferrin, and free of artificial flavors and sweeteners."},{"name":"PaleoMeal&reg; Vanilla Powder 540 gm","description":"PaleoMeal is a great-tasting, nutrient-rich powdered meal supplement designed to help promote an optimal intake of protein, fats, carbohydrates, vitamins and minerals needed for overall wellness. The ingredients make this formula ideal for patients needing support with weight control, GI health, detoxification, immune issues, heavy metals, and muscle gain.PaleoMeal is made with Proserum, exceptional quality, native whey protein concentrate. This whey is produced using minimal processing, and maintains the full range of all the fragile immune-boosting and regenerative components naturally present in fresh raw milk. It comes from cows that graze on pesticide-free, chemical-free natural grass pastures, and which are never given hormones, genetically modified organisms, or injected pathogens. The result is the highest quality protein supplement, rich in immunoglobulins and lactoferrin, and free of artificial flavors and sweeteners."},{"name":"PaleoMeal&reg; Powder Vanilla 900 grams","description":"PaleoMeal is a great-tasting, nutrient-rich powdered meal supplement designed to help promote an optimal intake of protein, fats, carbohydrates, vitamins and minerals needed for overall wellness. The ingredients make this formula ideal for patients needing support with weight control, GI health, detoxification, immune issues, heavy metals, and muscle gain.PaleoMeal is made with Proserum, exceptional quality, native whey protein concentrate. This whey is produced using minimal processing, and maintains the full range of all the fragile immune-boosting and regenerative components naturally present in fresh raw milk. It comes from cows that graze on pesticide-free, chemical-free natural grass pastures, and which are never given hormones, genetically modified organisms, or injected pathogens. The result is the highest quality protein supplement, rich in immunoglobulins and lactoferrin, and free of artificial flavors and sweeteners."},{"name":"PaleoMeal&reg;-DF Berry 540 grams","description":"PaleoMeal-DF is a great-tasting, nutrient-rich powdered meal supplement designed to help promote an optimal intake of protein, fats, carbohydrates, vitamins and minerals needed for overall wellness. The ingredients make this formula ideal for patients needing support with weight control, GI health, detoxification, immune issues, heavy metals, and muscle gain.PaleoMeal-DF is a dairy-free, plant-derived alternative to our popular whey-based PaleoMeal, featuring a natural pea protein isolate as its protein source. This formula is casein-free, lactose-free and gluten-free and offers the same comprehensive blend of added nutrients as our original PaleoMeal to promote health and healing."},{"name":"PaleoMeal&reg;-DF Vanilla 540 grams","description":"PaleoMeal-DF is a great-tasting, nutrient-rich powdered meal supplement designed to help promote an optimal intake of protein, fats, carbohydrates, vitamins and minerals needed for overall wellness. The ingredients make this formula ideal for patients needing support with weight control, GI health, detoxification, immune issues, heavy metals, and muscle gain.PaleoMeal-DF is a dairy-free, plant-derived alternative to our popular whey-based PaleoMeal, featuring a natural pea protein isolate as its protein source. This formula is casein-free, lactose-free and gluten-free and offers the same comprehensive blend of added nutrients as our original PaleoMeal to promote health and healing."},{"name":"PaleoReds&trade; Strawberry Powder 270 grams","description":"Physicians and nutritionists are recommending a diet rich in brightly-colored fruits and vegetables because they contain phytonutrients that act as antioxidants to ward off free radical damage. From polyphenols in apples to natural vitamin C from the Amazonian acerola cherry, PaleoReds combines over a dozen fruits and vegetables and their phytonutrients from the red\/purple group to help reduce the risk of common chronic diseases and premature aging. For our PaleoReds powder, Designs for Health has chosen the highest quality, antioxidant-rich ingredients, with over 80% being certified organic and all of which meet the stringent standards. The grape skin extract is standardized to resveratrol and the pomegranate is standardized to ellagic acid. This great tasting fruit and berry formula is ideal for patients who need antioxidants, yet are sensitive to synthetic vitamin C made from corn."},{"name":"Pantothenic Acid 500 mg 120 capsules","description":"Pantothenic acid is water-soluble vitamin B5. After absorption, it is converted to pantethine. Pantothenic acid is a component of coenzyme A, which is required to generate energy from fats, carbohydrates, and protein. CoA is also required to synthesize fats, cholesterol, acetylcholine, melatonin and steroid hormones."},{"name":"P.B. Meal &trade; - Case of 12","description":"P.B. Meal (Peanut Butter Macro-Bar) is a great tasting peanut butter\/chocolate food bar which features a balanced macronutrient blend of protein, carbohydrates, fats and fiber for sustained energy and hunger control. It contains a mixture of high biologic value proteins from whey isolate and concentrate as well as easy to digest rice protein concentrate.*P.B. Meal contains a natural blend of fast, medium, and slow releasing carbohydrates. It is sweetened with tapioca syrup (manioc starch) and maltitol, and as with all of our bars, it is fructose and sucrose-free."},{"name":"PerioBiotic&trade; Toothpaste Fennel Flavor 118g","description":"Featuring Dental-Lac, a patent pending functional lactobacillus dental hygiene probiotic not found in any other toothpaste product. Research on Dental-Lac, a specific Lactobacillus paracasei strain, has shown that it competes with unhealthy strains of oral bacteria including streptococcus mutans, thereby helping to maintain healthy teeth and gums. Like probiotics in the human intestinal tract, beneficial flora in the mouth are critical to maintaining dental and oral health. PerioBiotic Toothpaste also contains xylitol and calcium glycerophosphate, two active ingredients that have been shown in research to promote dental and oral health via their cavity-fighting abilities.* Whats not in PerioBiotic does matter...The ingredients not found in PerioBiotic Toothpaste, which are found in most other toothpastes include: fluoride, sodium lauryl sulfate (SLS), and saccharin. Also, this product is not harmful if swallowed as it does not contain fluoride."},{"name":"PerioBiotic&trade; Toothpaste Spearmint Flavor 118g","description":"Featuring Dental-Lac, a patent pending functional lactobacillus dental hygiene probiotic not found in any other toothpaste product. Research on Dental-Lac, a specific Lactobacillus paracasei strain, has shown that it competes with unhealthy strains of oral bacteria including streptococcus mutans, thereby helping to maintain healthy teeth and gums. Like probiotics in the human intestinal tract, beneficial flora in the mouth are critical to maintaining dental and oral health. PerioBiotic Toothpaste also contains xylitol and calcium glycerophosphate, two active ingredients that have been shown in research to promote dental and oral health via their cavity-fighting abilities.* Whats not in PerioBiotic does matter...The ingredients not found in PerioBiotic Toothpaste, which are found in most other toothpastes include: fluoride, sodium lauryl sulfate (SLS), and saccharin. Also, this product is not harmful if swallowed as it does not contain fluoride."},{"name":"PharmaGABA&trade; 60 Chewables","description":"PharmaGABA is naturally-sourced, bioidentical GABA (gamma-aminobutyric acid). It is made via a process where the amino acid glutamic acid (glutamate) is fermented using Lactobacillus hilgardii, the beneficial bacteria also used to ferment many foods including the vegetables in kimchi, the famous Korean dish. PharmaGABA provides 200 mg of GABA per serving (two tablets). Its chewable tablet delivery allows for rapid and efficient absorption and assimilation.* As a result, benefits are felt very quickly.GABA is a naturally occurring amino acid in the brain and is a major inhibitory neurotransmitter in the central nervous system (CNS). GABA serves as a critical calming agent for the body, helping to combat stress and anxiety."},{"name":"Phosphatidylcholine 300 gm Powder","description":"Phosphatidylcholine powder and softgels are excellent for emulsifying fat, making it extremely valuable for liver health. It is ideal for supporting absorption of all fat soluble nutrients.*"},{"name":"Phosphatidylcholine 420 mg 180 softgels","description":"Phosphatidylcholine powder and softgels are excellent for emulsifying fat, making it extremely valuable for liver health. It is ideal for supporting absorption of all fat soluble nutrients.*"},{"name":"Phosphatidylserine 50g Powder","description":"Phosphatidylserine (PS) is an essential component of all neuronal membranes. Human research suggests PS may help support overall brain wellness.* PS helps maintain healthy cortisol levels and is beneficial for memory and concentration.* Phosphatidylserine Powder is an excellent delivery system for children and the elderly who may have difficulty swallowing capsules.* PS powder has virtually no taste and will dissolve into applesauce or any food."},{"name":"Phosphatidylserine 150mg 60 caps","description":"PS 150 features 150 mg of non-soy, sunflower-sourced phosphatidylserine (PS) per capsule. There are no foods rich in PS, so supplementation is essential in order to increase the body&#039;s levels of this brain-supportive nutrient."},{"name":"Plant Enzyme Digestive Formula 90 vegetable capsules","description":"Plant Enzyme Digestive Formula is a digestive support formula ideal for vegetarians. Use for occasional gas, bloating, irregularity, or a feeling of fullness after eating."},{"name":"Acetyl L-Carnitine 800mg 90 vegetarian capsules","description":"Acetyl L-Carnitine is the acetylated ester of L-carnitine, and plays an important role in the transfer and utilization of  long-chain fatty acids, which are used in the production of energy. It supports  biosynthesis of acetylcholine, the most abundant neurotransmitter in the body,  regulating activities of vital organs and blood vessels and communication  between nerves and muscles."},{"name":"Acnutrol&trade; 180 capsules","description":null},{"name":"Acnutrol&trade; 3 oz Gel","description":"Acnutrol  topical gel is a blend of ingredients designed to help support skin and acne  breakouts on the face or other skin surfaces. It works by targeting the two  largest contributing factors of acne, bacteria and the inflammatory response.  While many topical skin support creams, ointments, and gels often cause skin  irritation and dryness, Acnutrol Gel is an effective and safe product without  any unwanted side effects. "},{"name":"Adrenal Complex 120 capsules","description":"Adrenal  Complex is a glandular-based product designed to support overall adrenal function.  It is fortified with N-acetyl tyrosine, vitamin C and a comprehensive spectrum of B vitamins.  Adrenal Complex is ideal for those under chronic stress due to its ability to  balance cortisol and replenish catecholamines (dopamine, norepinephrine, and epinephrine)."},{"name":"Adrenal Complex 240 Capsules","description":"Adrenal Complex is a glandular-based product designed to support overall adrenal function. It is fortified with N-acetyl tyrosine, vitamin C and a comprehensive spectrum of B vitamins. Adrenal Complex is ideal for those under chronic stress due to its ability to balance cortisol and replenish catecholamines (dopamine, norepinephrine, and epinephrine)."},{"name":"Adrenotone&trade; 90 capsules","description":"Adrenotone  is a combination of standardized herbs and nutrients which are known for  rejuvenating the adrenals. This product is designed to promote healthy cortisol  levels, hypothalamic and pituitary function (HPTA axis), and catecholamine  production (dopamine, norepinephrine, and epinephrine).* Adrenotone does not contain glandulars."},{"name":"Adrenotone&trade; 180 capsules","description":"Adrenotone  is a combination of standardized herbs and nutrients which are known for  rejuvenating the adrenals. This product is designed to promote healthy cortisol  levels, hypothalamic and pituitary function (HPTA axis), and catecholamine  production (dopamine, norepinephrine, and epinephrine).* Adrenotone does not contain glandulars."},{"name":"AllerGzyme&trade; 90 capsules","description":"AllerGzyme  is a full spectrum proteolytic enzyme complex that assists with the digestion  of difficult-to break-down proteins such as gluten, gliadin, and casein from  whey and dairy, as well as many other protein sources in the diet, including  soy and rice. The formula consists of two complementary blends of proteases:  BioCore Pro, which maintains activity in wide ranges of pH, and BioCore Edge,  which supports the proper hydrolysis of the proteins found in soy, whey, and  casein protein powders."},{"name":"Allicillin&trade; 60 softgels","description":null},{"name":"Aloe\/200x&trade; 60 capsules","description":"The name  Aloe\/200x refers to the fact that it takes 200 pounds of the Aloe vera inner  gel fillets to make one pound of this nourishing aloe extract. This  concentrated aloe is made with the intent to retain as much of the plants  natural makeup as possible. The natural  components are retained by never filtering the product and by never allowing  the product to reach temperatures above 99 Fahrenheit. This low-heat  dehydration system ensures that the long polysaccharide chains remain intact,  as they are found in nature. The longer the polysaccharide chain, the greater  the effectiveness in supporting immune function."},{"name":"Amino Acid Synergy 120 capsules","description":"Amino Acid  Synergy is useful as a general supplement for individuals whose diets are  insufficient in quality protein, such as athletes who require additional amino  acids to maintain or achieve greater lean body mass, and for those who have  confirmed amino acid deficiencies from metabolic testing. Amino Acid Synergy  provides a mixture of essential amino acids in the free-form, meaning they are  immediately available for absorption and can be put to metabolic use much more  readily and rapidly, as compared to amino acids contained in dietary protein."},{"name":"Amino-D-Tox&trade;  90 capsules","description":"Amino-D-Tox  is useful for preparing the liver for phase II detoxification. It does not  contain botanicals, minerals, or B vitamins that would also upregulate phase I  detoxification, which may result in intermediate metabolites that could cause  sensitivity reactions. Providing nutritional support for phase II  detoxification helps conjugate toxins and prepare them for safe elimination  from the body."},{"name":"Amino-D-Tox&trade; 180 capsules","description":"Amino-D-Tox  is useful for preparing the liver for phase II detoxification. It does not  contain botanicals, minerals, or B vitamins that would also upregulate phase I  detoxification, which may result in intermediate metabolites that could cause  sensitivity reactions. Providing nutritional support for phase II  detoxification helps conjugate toxins and prepare them for safe elimination  from the body."},{"name":"Annatto Tocotrienols 60 capsules","description":null},{"name":"Aphthamin&trade;, 60 lozenges","description":null},{"name":"Arginine 750mg 120 capsules","description":"L-Arginine  is a clinically useful amino acid for enhancing heart health, the circulatory  system and the immune system.* It is a precursor of nitric oxide, known to be  important for blood pressure maintenance and healthy endothelial function.*  Arginine may be used along with LibidoStim-M or LibidoStim-F, but is not  recommended with erectile dysfunction medications. Arginine is often used with  HTN Complex for the natural promotion of healthy blood pressure."},{"name":"Arthroben&trade; 330 grams (Original Green Apple Flavor)","description":null},{"name":"Arthroben&trade; 330 grams (Lemon Lime Flavor)","description":null},{"name":"Arthroben&trade; 240 grams (Unflavored\/Unsweetened)","description":null},{"name":"ArthroSoothe&trade; 120 capsules","description":"ArthroSoothe  gives joints nutritional support for repair, lubrication, free movement, and  healthy function. Joints, cartilage, ligaments, tendons and synovial fluid (for  joint lubrication) undergo a continuous but slow turnover and remodeling  process. This is affected by many physiological factors such as diet,  supplements, activity, stress, gut health, allergies, immune status,  infections, aging, hormones, toxic load and\/or various medications. "},{"name":"ArthroSoothe&trade; Cream 85 grams","description":"This  soothing topical cream can be used for joint and muscle discomfort. It is a  wonderful compliment to our encapsulated ArthroSoothe product. Topical  application provides tissue-warming and surface-cooling effects, utilizing a  complex and complete formulation. "},{"name":"ArthroSoothe&trade; Supreme 120 capsules","description":"ArthroSoothe  Supreme contains all of the ingredients found in our standard ArthroSoothe,  plus the revolutionary tissue regeneration factor or TRF (as Cyplexinol PRO). TRF  is a bone-derived complex containing collagen and biologically active proteins  known as Body\/Bone Morphogenetic Proteins (BMPs). BMPs are the components that  activate the cartilage-forming process, which is necessary for joint integrity  and regeneration. They also help suppress inflammatory cytokines, leading to  joint and cartilage homeostasis. TRF works synergistically with glucosamine  sulfate and helps to make ArthroSoothe Supreme an ideal choice when more involved  attention to cartilage health is desired. "},{"name":"Astaxanthin 6 mg 60 softgels","description":null},{"name":"B-Supreme 60 capsules","description":"This very powerful B vitamin combination formula supplies most of  the B vitamins in their coenzymated forms, so the body does not have to  phosphorylate them in  order to be used in biochemical reactions. This formula also includes  our proprietary NatureFolate blend of active isomer naturally-occurring  folates. TMG and choline are included to support methylation."},{"name":"B-Supreme 120 capsules","description":"This very powerful B vitamin combination formula supplies most of  the B vitamins in their coenzymated forms, so the body does not have to  phosphorylate them in  order to be used in biochemical reactions. This formula also includes  our proprietary NatureFolate blend of active isomer naturally-occurring  folates. TMG and choline are included to support methylation."},{"name":"Baxaprin&trade; 180 capsules","description":"Baxaprin is a revolutionary formula designed to help relieve occasional muscle tension and cramping related to stress or overuse of the muscle. This calming formula is designed to support core musculoskeletal physiology of the back so as to limit muscular stress on the spine and associated tissues.*"},{"name":"Betaine HCL (with pepsin) 750 mg 120 capsules","description":"Betaine HCL provides 750 mg betaine hydrochloride along with pepsin, a key protein digestive enzyme produced in the stomach. This product is ideal for those who are looking to support their stomachs digestive function. Taking one capsule before a meal aids digestion, especially the digestion of protein-containing foods, and helps with the assimilation of nutrients.This product is not recommended for anyone diagnosed with any type of ulcer or gastritis, or those with an overproduction of acid.This product was previously in a tablet form, however we have upgraded to a capsule. This ensures delivery of betaine HCL and pepsin to the stomach where they are needed to initiate digestion."},{"name":"Brain Power Sours (Raspberry) case","description":null},{"name":"Brain Vitale&trade; 60 capsules","description":null},{"name":"Brain Vitale&trade; 120 capsules","description":null},{"name":"Brain Vitale&trade; 50gm powder","description":null},{"name":"BroccoProtect&trade; 90 capsules","description":null},{"name":"Q-Avail&trade; VS 100mg 60 softgels","description":"QAvail VS 100 and 200 use a patented, micro-emulsion delivery system which allows us to pack high doses of Ubiquinone CoQ10 in an easy-to-swallow softgel."},{"name":"Q-Avail&trade; VS 200mg 60 softgels","description":"QAvail VS 100 and 200 use a patented, micro-emulsion delivery system which allows us to pack high doses of Ubiquinone CoQ10 in an easy-to-swallow softgel."},{"name":"Quercetin + Nettles 90 vegetarian capsules","description":"Quercetin + Nettles contain 600 mg quercetin and 600 mg nettles. Research suggests that nettles anti-inflammatory actions are attributed to its ability to interrupt the production and actions of inflammation-producing cytokines, prostaglandins and leukotreines."},{"name":"Quercetin-Ascorbate 100 gm Powder","description":"Quercetin Ascorbate powder is a powerful flavonoid and antioxidant blend. Quercetin is one of several flavonoids that have effects on mast cells and basophils. Vitamin C helps regulate histamine levels and helps control inflammatory responses."},{"name":"Resveratrol Synergy&trade; 60 vegetarian capsules","description":"Exciting research continues to emerge concerning the powerful polyphenol resveratrol, which is found in peanuts, berries, the skin of red grapes, red wine, and in the Japanese knotweed plant, also known as polygonum. Resveratrol research has proven it to be a very potent antioxidant which, among other things, acts as a sirtuin activator, meaning it activates the SirT1 gene, which is believed to provide an anti-aging effect. The polygonum source used in Resveratrol Synergy is standardized to 50% resveratrol, all in the trans form."},{"name":"Ribo-CarniClear&trade; 8 OZ","description":"Ribo-CarniClear liquid is a tasty way to get high doses of ribose and carnitine, two very important nutrients known for heart health, energy enhancement and muscle recovery.* Both of these nutrients increase cellular energy production. Carnitine specifically increases energy levels by helping fat to be burned for energy. Start with 1?4 teaspoon daily and increase slowly up to 1-4 teaspoons daily."},{"name":"RYR Synergy 120 Capsules","description":"RYR Synergy, a natural support for keeping healthy lipid levels in the normal range, features the same USDA certified organic red yeast rice as found in our Organic RYR, with added coenzyme Q10. The CoQ10 in RYR Synergy is the same as that found in our Q-Avail VS Powder that uses the patented VESIsorb delivery system which has been shown to significantly increase absorption and bioavailability."},{"name":"C+BioFizz&trade; Effervescent 144g Powder","description":"This  delicious, effervescent, orange-flavored powder easily provides therapeutic  dosing of vitamin C and bioflavonoids. Potassium bicarbonate is included in  this formula as a buffering agent and to give it fizz. Also included are quercetin,  hesperidin and rutin, which are all natural bioflavonoids found in citrus  fruits. "},{"name":"C3 Curcumin Complex 60 vegetarian capsules","description":"C3 Curcumin  Complex is a powerful antioxidant containing three different bioactive forms of  curcuminoids from the spice turmeric. This antioxidant combination has been  shown to support organs like the colon, liver and heart by neutralizing  damaging free radicals. The emulsifier lecithin was added to increase  absorption. "},{"name":"Cal\/Mag 1:1 180 capsules","description":null},{"name":"Cal\/Mag 2:1 180 capsules","description":null},{"name":"Calcium-D-Glucarate 60 capsules","description":null},{"name":"Calcium Malate Chelate 250 mg 120 capsules","description":"Calcium  Malate Chelate combines two unique forms of calcium for exceptional absorption  and utilization. Calcium glycinate chelate provides calcium that is fully  chelated to glycine for superior absorption, while the calcium in di-calcium  malate is bound to malic acid for excellent absorption and support of energy  production in the Krebs cycle. The recommended dosage of two capsules yields  500 mg of elemental calcium along with 100 IU of vitamin D. "},{"name":"CarbXzyme&trade; 120 capsules","description":null},{"name":"Cardio Synergy Herbal 120 capsules","description":"Cardio Synergy Herbal is formulated to help support optimal heart function, stroke volume and endothelial health. It consists of the cardio-supportive herbs arjuna, hawthorne extract, jiaogulan, Chinese salvia, and grape seed extract."},{"name":"CarniClear&trade; Liquid Carnitine 8 oz","description":null},{"name":"Carnitine Synergy&trade; 120 vegetarian capsules","description":null},{"name":"Carnitine Tartrate 100 gm powder","description":null},{"name":"Carnosine Supreme&trade; 60 vegetarian capsules","description":"Carnosine is a naturally occurring combination of the amino acids alanine and histidine. In this novel formula carnosine is combined with benfotiamine, a fat soluble form of thiamine (vitamin B1), to help support healthy aging. Carnosine and benfothiamine are shown to possess antioxidant activity and collagen-supportive properties, and help with the inhibition of glycosylation of proteins caused by excessive glucose\/fructose consumption. "},{"name":"CatecholaCalm&trade; 90 vegetarian capsules","description":null},{"name":"C.C. Meal&trade; Bar case of 12","description":"Dark Chocolate\/Cherry Flavored  the antioxidant-rich food barC.C.Meal is a great tasting, low-glycemic food bar which features a balanced macronutrient combination of protein, carbohydrates, fats and fiber for sustained energy and hunger control. It is similar to our P.B.Meal bar, yet it has its own unique taste and characteristics, with its delicious flavor derived from a combination of dark chocolate and tart cherries (Prunus cerasus)."},{"name":"CelerEase&trade; 60 capsules","description":null},{"name":"Chocolate Mint Fiber Bar - Case of 18","description":null},{"name":"Chromium Synergy&trade; 90 vegetarian capsules","description":"Chromium Synergy is a synergistic formula of nutrients for optimal insulin function and blood sugar control. It combines the best chelated minerals from Albion Advanced Nutrition in a base of cinnamon powder to assist insulin receptor function and cellular glucose uptake.*"},{"name":"CLA softgels","description":null},{"name":"Cocommune&trade; 40g Case of 18","description":"This popular functional food bar contains a blend of fibers and natural sweeteners that are less prone to affect those with GI sensitivities. Cocommune Bar features an IMO (isomalto oligosaccharide) vegetable fiber with a host of health benefits. This natural, soluble, prebiotic dietary fiber naturally supports healthy mineral absorption, bowel pH, immune system function, and composition of intestinal microbiota. "},{"name":"CogniAid&trade; 60 capsules","description":"CogniAid is an herbal formula designed to help support healthy cognition, mood and memory. This product supplies herbs and extracts that have been shown to work through a variety of mechanisms, including helping to maintain proper levels of the neurotransmitter acetylcholine, as well as supporting healthy neurons and nerve impulse transmission. CogniAid contains a wildcrafted blueberrycomplex, a novel berry extract that in addition to blueberries uses extracts of huckleberries and bilberries. This product also features vinpocetine, Huperzine A (a naturally occurring alkaloid compound), the green tea polyphenol EGCg, and the Ayurvedic herb Bacopa monnieri."},{"name":"ColonRx&trade;, 60 capsules","description":null},{"name":"Complete Mineral Complex 90 vegetarian capsules","description":"Complete  Mineral Complex is ideal for use when mineral replenishment is desired. This  product is iron-free and utilizes the finest chelated minerals from Albion  Advanced Nutrition for optimal absorption. "},{"name":"CoQnol&trade; (non-GMO Ubiquinol) 50mg 60 softgels","description":"CoQnol is a non-GMO form of ubiquinol, which is the reduced, antioxidant form of CoQ10. Both ubiquinone and ubiquinol are critical to the cellular ATP (energy) production cycle. Without the presence of both ubiquinone and ubiquinol within the bodys cells, cellular energy cannot be generated or sustained. The ability to convert ubiquinone to ubiquinol may diminish with age and with increased oxidative stress in certain individuals."},{"name":"CoQnol&trade; (non-GMO Ubiquinol) 100mg 60 softgels","description":"CoQnol is a non-GMO form of ubiquinol, which is the reduced, antioxidant form of CoQ10. Both ubiquinone and  ubiquinol are critical to the cellular ATP (energy) production cycle. Without  the presence of both ubiquinone and ubiquinol within the bodys cells, cellular  energy cannot be generated or sustained. The ability to convert ubiquinone to  ubiquinol may diminish with age and with increased oxidative stress in certain  individuals. "},{"name":"CraveArrest&trade; 120 vegetarian capsules","description":null},{"name":"D-Ribose 150 grams","description":"Ribose synthesizes adenine nucleotides, which are required by cardiac muscle and other tissue to make adenosine-triphosphate (ATP), the primary source of energy used by all cells to maintain normal health and function. D-Ribose may be ideal for athletes and weekend warriors, or to help support cardiovascular health and energy levels.*"},{"name":"Detox Antiox&trade;  60 capsules","description":null},{"name":"DFH Complete Multi&trade; 180 capsules","description":null},{"name":"DFH Complete Multi&trade; w\/ Copper &amp; Iron 180 vegetarian caps","description":"DFH Complete Multi with Copper and Iron is a full-spectrum multivitamin with Albion chelated minerals for maximum absorption and bioavailability. This powerhouse multivitamin supplies supportive nutrients not normally found in regular multis, such as alpha lipoic acid, TMG, fruit bioflavanoids, choline, and inositol. This formula also contains high gamma tocopherol vitamin E, high levels of all the B vitamins, including our proprietary NatureFolate blend of active isomer naturally-occurring folates, and natural mixed carotenoids. This vegetarian formula is appropriate for teenagers, menstruating females, lactating women and individuals who avoid eating red meat. "},{"name":"DFH Complete Multi&trade; with Copper (iron-free) 180 capsules","description":"DFH Complete Multi with Copper is a full-spectrum multivitamin with Albion chelated minerals for maximum absorption and bioavailability. This powerhouse multivitamin supplies supportive nutrients not normally found in regular multis, such as alpha lipoic acid, TMG, fruit bioflavonoids, choline, and inositol. This formula also contains high gamma tocopherol vitamin E, high levels of all the B vitamins, including our proprietary NatureFolate blend of active isomer naturally-occurring folates, and natural mixed carotenoids. This version of our DFH Complete Multi contains 2 mg of copper as copper glycinate chelate, a stabilized mineral chelate from Albion Minerals that reduces the risk of free copper in the body, which can cause oxidative stress. This multi is also iron and PABA free. "},{"name":"Detoxification Support Packets 60 packets","description":"We are being inundated with toxins on a daily basis. Our ability to maintain health in a toxic environment is dependent on our bodys ability to detoxify. These packets are recommended as the starting point for detoxification programs, for anyone who needs regular detoxification support, or for those who want extra help before such things as dental amalgam removal or heavy metal chelation. "},{"name":"DHEA 5mg 180 capsules","description":null},{"name":"DHEA 25 mg 60 vegetarian capsules","description":null},{"name":"Digestzymes&trade; 90 capsules","description":null},{"name":"Digestzymes&trade; 180 capsules","description":null},{"name":"DIM-Avail&trade; 60 softgels","description":null},{"name":"DIM-Avail&trade;120 softgels","description":null},{"name":"DopaBoost&trade; 60 Capsules","description":"DopaBoost is designed to support the bodys natural production of dopamine, one of the primary catecholamines. Dopamine is essential for the normal functioning of the central nervous system and is associated with attention, learning, movement, balance, and mood regulation. The primary ingredient in DopaBoost is Macuna pruriens, a botanical which naturally contains L-DOPA, the metabolic precursor to dopamine which can cross the blood-brain barrier. Additional ingredients include EGCg (epigallocatechin-3-gallate), acetyl L-tyrosine, quercetin and vitamin B6, all selected for their synergistic roles in the production and regulation of dopamine. "},{"name":"S-Acetyl Glutathione Synergy 60 Capsules","description":null},{"name":"SAMe 30 capsules","description":"SAMe is a naturally occurring metabolite found in the human body as well as in plant and animal foods. It is the most active of all methyl donors and has been compared to ATP in its importance for the body. SAMe is naturally synthesized in humans from the amino acid methionine in the presence of the cofactors B12 and folate. SAMe is involved in the synthesis of neurotransmitters, the hormone melatonin, phospholipids, and polyamines, which control cellular growth. It is also the source of methyl groups inside the nucleus for DNA methylation, which controls gene expression and masking of genetic damage. These capsules provide 200 mg of SAMe along with vitamins B6, B12, and folate as 5-MTHF in order to provide cofactors for the natural conversions of SAMe to L-homocysteine and then safely to L-cysteine."},{"name":"SAMe 90 capsules","description":"SAMe is a naturally occurring metabolite found in the human body as well as in plant and animal foods. It is the most active of all methyl donors and has been compared to ATP in its importance for the body. SAMe is naturally synthesized in humans from the amino acid methionine in the presence of the cofactors B12 and folate. SAMe is involved in the synthesis of neurotransmitters, the hormone melatonin, phospholipids, and polyamines, which control cellular growth. It is also the source of methyl groups inside the nucleus for DNA methylation, which controls gene expression and masking of genetic damage. These capsules provide 200 mg of SAMe along with vitamins B6, B12, and folate as 5-MTHF in order to provide cofactors for the natural conversions of SAMe to L-homocysteine and then safely to L-cysteine."},{"name":"Silvercillin&trade; Gel 4oz","description":"Silvercillin is a highly effective antimicrobial preparation composed of pure silver complexed with purified water. Silvercillin uses Silver Sol Technology, the term sol being a designation of a mineral permanently distributed into the structure of water. The silver becomes a part of that water molecule permanently so it will not fall out of solution or suspension. Silvercillin is an incredibly highly powerful, non-toxic form of silver, with zero build-up in the body, so it does not cause argyria (blue man syndrome)."},{"name":"Silvercillin&trade; 16oz Liquid","description":"Silvercillin is a highly effective antimicrobial preparation composed of pure silver complexed with purified water. Silvercillin uses Silver Sol Technology, the term sol being a designation of a mineral permanently distributed into the structure of water. The silver becomes a part of that water molecule permanently so it will not fall out of solution or suspension. Silvercillin is an incredibly highly powerful, non-toxic form of silver, with zero build-up in the body, so it does not cause argyria (blue man syndrome)."},{"name":"Silvercillin&trade; Spray 4oz","description":"Silvercillin is a highly effective antimicrobial preparation composed of pure silver complexed with purified water. Silvercillin uses Silver Sol Technology, the term sol being a designation of a mineral permanently distributed into the structure of water. The silver becomes a part of that water molecule permanently so it will not fall out of solution or suspension. Silvercillin is an incredibly highly powerful, non-toxic form of silver, with zero build-up in the body, so it does not cause argyria (blue man syndrome)."},{"name":"Stabilized R-Lipoic Acid Supreme 60 vegetarian capsules","description":"Stabilized R-Lipoic Acid, which many may simply know as lipoic acid, provides a stabilized and isolated RLA (R-lipoic acid isomer) thanks to technological advancements. Since SLA (S-lipoic acid isomer) can interfere with RLAs efficacy, supplementing with pure RLA provides a significant advantage for intensive lipoic acid supplementation. Once separated from SLA, RLA is extremely unstable. Binding RLA to potassium, as found in this unique product, solves this problem. Unlike other R-Lipoic products, Stabilized R-Lipoic Acid is a non-hydroscopic, non-polymeric potassium salt form of RLA."},{"name":"Stellar C&trade; 90 vegetarian capsules","description":"Stellar C is rich in vitamin C (from a mixture of ascorbic acid and acerola fruit) and plant bioflavonoids (hesperidin, rutin, quercetin and mixed citrus bioflavonoids), known for their immunoprotective properties. In addition to supporting healthy immune function, these nutrients have been used historically for applications such as maintaining healthy veins, capillaries, skin, hair and nails by supporting normal collagen production and repair.*"},{"name":"StressArrest&trade; 90 vegetarian capsules","description":"StressArrest is a uniquely formulated product which provides gamma-aminobutyric acid (GABA), a key neurotransmitter in the body involved in a normal calm stress response. In addition, it supplies other calming nutrients including glycine, niacinamide, pantothenic acid and vitamin B6."},{"name":"Sublingual B-6 Liquid 4oz","description":"Sublingual B6 Liquid tastes great with a natural raspberry flavor, absorbs easily, and is the perfect solution for people who need higher doses of this often-lacking vitamin. This unique formula works synergistically to support numerous bodily reactions, such as neurotransmitter production, hormone metabolism and much more."},{"name":"Taurine 1000mg 120 vegetarian capsules","description":"Taurine capsules and powder deliver effective doses of this sulfur-containing amino acid found mainly in meat and seafood. Vegetarians and non-meat\/fish eaters therefore may not be meeting their requirements for taurine. Scientists are unsure whether humans make enough taurine, and elevated levels of homocysteine often suggests the body may be having difficulty making this compound. This high-quality formula of pure taurine powder makes getting meaningful doses easy for people who do not like to swallow capsules or need higher doses of this amino acid. Taurine is also needed to make bile and taurocholic acid."},{"name":"Taurine Powder 100 grams","description":"Taurine capsules and powder deliver effective doses of this sulfur-containing amino acid found mainly in meat and seafood. Vegetarians and non-meat\/fish eaters therefore may not be meeting their requirements for taurine. Scientists are unsure whether humans make enough taurine, and elevated levels of homocysteine often suggests the body may be having difficulty making this compound. This high-quality formula of pure taurine powder makes getting meaningful doses easy for people who do not like to swallow capsules or need higher doses of this amino acid. Taurine is also needed to make bile and taurocholic acid."},{"name":"Tegricel&reg; Colostrum 90 vegetarian capsules","description":"Tegricel uses the latest technology to produce a pure, potent colostrum that supports optimum immune function and intestinal health. It provides a perfect combination of immune and growth factors including immunoglobulins, lactoferrin, insulin-like growth factor 1 (IGF-1), amino acids, and other important nutrients. Unlike other brands, Tegricel Colostrum comes from healthy, nutritionally supplemented cattle raised in the U.S. on USDA and FDA certified dairy farms. These cattle are carefully fed a scientifically designed diet that contains the proper balance of legumes and grasses, along with minerals and trace minerals to ensure consistently high potency colostrum."},{"name":"Thermo-EFx&trade;, 60 capsules","description":"Thermo-EFx is designed to support healthy weight loss by helping to increase the bodys metabolic rate safely without causing any stimulant-associated side effects often seen with other weight reduction formulas."},{"name":"Thyroid Synergy&trade; 120 vegetarian capsules","description":"Thyroid Synergy was designed to be a top-quality, all-in-one formula for the nutritional support of thyroid function. The non-stimulating adaptogenic botanical American ginseng (Panax quinquifolius) helps maintain healthy cortisol, blood glucose and insulin levels, along with a balanced conversion of peripheral thyroid hormone. Essential vitamins, minerals, and other nutrients work synergistically to provide a premium thyroid product in just two capsules a day."},{"name":"TRF 150&trade; 30 capsules","description":"TRF 150 and TRF 350 provide nutritional support for healthy joint function, repair, and relief of occasional inflammation. These products feature Cyplexinol PRO, a bone derived protein\/collagen complex containing Bone Morphogenetic Proteins (BMPs) and key growth factors naturally contained in bone. This ingredient helps to support the pathways involved in normal bone remodeling, and the proper repair and regeneration of cartilage, thereby supporting good bone health and joint integrity."},{"name":"TRF 350&trade; 30 capsules","description":"TRF 150 and TRF 350 provide nutritional support for healthy joint function, repair, and relief of occasional inflammation. These products feature Cyplexinol PRO, a bone derived protein\/collagen complex containing Bone Morphogenetic Proteins (BMPs) and key growth factors naturally contained in bone. This ingredient helps to support the pathways involved in normal bone remodeling, and the proper repair and regeneration of cartilage, thereby supporting good bone health and joint integrity."},{"name":"Tri-K&trade; 60 vegetarian capsules","description":null},{"name":"Twice Daily Essential Packets&trade;","description":"Twice Daily Essential Packets allow patients to get their daily essential nutrients in two easy packets. No need to count, sort, or measure. All the basics are here: Twice Daily Multi, Calcium Malate Chelate, and Magnesium Malate (both excluded from the Twice Daily Multi to allow for meaningful doses), in addition to omega-3 fatty acids.Twice Daily Essential Packets are a perfect foundation for people just getting started on a vitamin regimen, those focused on comprehensive maintenance, and as a starting point for weight loss programs and other health regimens."},{"name":"Twice Daily Multi&trade; 60 vegetarian capsules","description":"Twice Daily Multi contains optimal amounts of many nutrients not easily obtained in most diets. It uses higher quality ingredients than most multivitamins, including vitamin E as high gamma mixed-tocopherols, our proprietary NatureFolate blend of active isomer naturally-occurring folates, and TRAACS true amino acid chelate minerals for optimal tolerance and absorption. These exceptional ingredients are combined in an up-to-date, science-based formulation to create a truly superior multi.*"},{"name":"Twice Daily Multi&trade; 120 vegetarian capsules","description":"Twice Daily Multi contains optimal amounts of many nutrients not easily obtained in most diets. It uses higher quality ingredients than most multivitamins, including vitamin E as high gamma mixed-tocopherols, our proprietary NatureFolate blend of active isomer naturally-occurring folates, and TRAACS true amino acid chelate minerals for optimal tolerance and absorption. These exceptional ingredients are combined in an up-to-date, science-based formulation to create a truly superior multi.*"},{"name":"Twice Daily Multi&trade; 240 vegetarian capsules","description":"Twice Daily Multi contains optimal amounts of many nutrients not easily obtained in most diets. It uses higher quality ingredients than most multivitamins, including vitamin E as high gamma mixed-tocopherols, our proprietary NatureFolate blend of active isomer naturally-occurring folates, and TRAACS true amino acid chelate minerals for optimal tolerance and absorption. These exceptional ingredients are combined in an up-to-date, science-based formulation to create a truly superior multi.*"},{"name":"L-Tyrosine 120 capsules","description":null},{"name":"EGCg 60 vegetarian capsules","description":"EGCg (epigallocatechin gallate) is a key active component of green tea (Camellia sinensis) leaves. It is valued for its antioxidant properties and has been studied extensively for weight loss through promotion of fat metabolism and for its role in supporting overall health and wellness. This formula contains green tea standardized to 45% EGCg. "},{"name":"Electrolyte Synergy&trade; Packets","description":null},{"name":"Hi-Po Emulsi-D3&trade; 1 oz. liquid","description":null},{"name":"Emulsi-D3 Synergy&trade; 2 oz liquid","description":null},{"name":"EndoTrim&trade; 120 vegetarian capsules","description":"EndoTrim is a comprehensive endocrine-balancing formula which focuses on healthy insulin, leptin, and cortisol function in order to support safe fat metabolism and maintenance of lean body mass. The inclusion of Garcinia cambogia and EGCg may also help to maintain and improve lean body mass and support basal metabolic rate. This unique array of nutrients and botanicals is also useful for controlling food cravings and helping the body naturally manage blood sugar levels. "},{"name":"EssentiaGreens&trade; Powder, 285 grams","description":null},{"name":"FemGuard+Balance&trade; 120 capsules","description":null},{"name":"Ferrochel&reg; Iron Chelate 120 vegetarian capsules","description":null},{"name":"FloraMyces&trade; 60 vegetarian capsules","description":null},{"name":"Foresterol&trade; 600 mg 90 tablets","description":null},{"name":"Ultimate Antiox Full Spectrum 90 Capsules","description":"Ultimate Antiox Full Spectrum is a unique antioxidant formula derived from a combination of some of natures most powerful herbs and spices, along with other classic and novel antioxidant compounds. These ingredients were chosen due to their ability to maintain the function and integrity of both water-based and lipid-based body structures and compounds, including cell membranes, LDL cholesterol, proteins, and enzymes.*"},{"name":"Ultra B12-Folate 90 capsules","description":"Ultra B12-Folate is a unique formula that combines vitamin B12 (cobalamin) with our proprietary NatureFolate blend of active isomer naturally-occurring folates. These two vitamins work synergistically, improving methylation and helping to promote balanced concentrations of homocysteine.* While many manufacturers offer them separately, this formula offers the convenience of getting both B vitamins in one capsule. The premium B12 in this product comes from equal amounts of adenosylcobalamin and methylcobalamin."},{"name":"Ultra Gamma E Complex 60 softgels","description":null},{"name":"UT Synergy&trade; 60 capsules","description":"UT Synergy features Hibiscus sabdariffa, a unique compound designed specifically to support the health of the urinary tract. Hibiscus sabdariffa is an extract of the Hibiscus species that is high in certain organic acids and polyphenols, especially flavonoids and proanthocyanidins. These compounds provide microbial inhibition and bacterial anti-adhesive properties. Additionally, this formula acts as a mild natural diuretic to support healthy kidney function and to provide a soothing effect on the genitourinary mucosal lining."},{"name":"Vessel Forte&trade;, 120 capsules","description":"Vessel Forte is a synergistic combination of natural extracts extensively researched for their benefits in regards to the health of blood vessels. Its ingredients are beneficial in supporting optimum blood and lymph circulation, and the strength and elasticity of blood vessels. Vessel Forte provides anti-inflammatory and antioxidant benefits as well."},{"name":"Vitamin B12 Lozenges","description":"Vitamin B12 lozenges are a great tasting, high dose vitamin B12 product. Each berry flavored lozenge contains 5000 mcg methylcobalamin, the activated form of vitamin B12. They are designed to deliver B12 through the mucous membranes in order to bypass the need for intrinsic factor, a protein produced in the stomach known to be needed for maximal GI absorption of B12."},{"name":"Vitamin C Buffered Powder 240g","description":"Vitamin C Buffered Powder was designed for high dosing of vitamin C and for vitamin C flushing, which may help determine ones individual need for vitamin C. Adding the alkalizing minerals calcium, magnesium and potassium results in a less acidic form of vitamin C that is better tolerated (less stomach upset) and provides the additional benefits of calcium, magnesium, and potassium supplementation (i.e., alkalizing effects, bone mineralization, etc.)."},{"name":"Vitamin D Complex 60 capsules","description":"Vitamin D Complex features 2000 IUs of vitamin D, along with efficacious amounts of the other fat-soluble vitamins, A, E (tocopherols and tocotrienols), and K (K1 and K2). While there are a myriad of beneficial health attributes associated with vitamin D, it is extremely important to keep it in balance with these other vitamins. Research is emerging on the intricate interrelationships between them, which should make one think twice about dosing any of these supraphysiologically without the others."},{"name":"Vitamin D Supreme 60 vegetarian capsules","description":"Vitamin D Supreme provides a clinically useful dose of vitamin D3 and vitamin K in both the K1 and MK-7 form of K2. This formula contains higher therapeutic doses than Vitamin D Synergy for situations where more aggressive repletion is required. Vitamins D and K are essential for optimal bone and arterial health and for maintaining the immune system in proper balance. The amount of vitamin D and K in this formula may be beneficial for those who do not get adequate sun exposure and\/or dietary sources of these vitamins. Vitamins D & K work as a team. Thus, increasing doses of vitamin D will increase the need for vitamin K."},{"name":"Vitamin D Supreme 180 capsules","description":"Vitamin D Supreme provides a clinically useful dose of vitamin D3 and vitamin K in both the K1 and MK-7 form of K2. This formula contains higher therapeutic doses than Vitamin D Synergy for situations where more aggressive repletion is required. Vitamins D and K are essential for optimal bone and arterial health and for maintaining the immune system in proper balance. The amount of vitamin D and K in this formula may be beneficial for those who do not get adequate sun exposure and\/or dietary sources of these vitamins. Vitamins D & K work as a team. Thus, increasing doses of vitamin D will increase the need for vitamin K."},{"name":"Vitamin D Synergy 120 vegetarian capsules","description":"Vitamin D Synergy provides a clinically useful dose of vitamin D3 and vitamin K in the form of K1. This formula can be replaced with Vitamin D Supreme when more aggressive therapeutic levels of vitamin D and K are required clinically. Vitamins D and K are essential for optimal bone and arterial health and for maintaining the immune system in proper balance."},{"name":"Vitamin D Synergy 240 vegetarian capsules","description":"Vitamin D Synergy provides a clinically useful dose of vitamin D3 and vitamin K in the form of K1. This formula can be replaced with Vitamin D Supreme when more aggressive therapeutic levels of vitamin D and K are required clinically. Vitamins D and K are essential for optimal bone and arterial health and for maintaining the immune system in proper balance."},{"name":"Vitamin D Ultra 10K","description":"Vitamin D Ultra 10K is our highest potency vitamin D product, providing 10,000 IU of vitamin D per serving, and is intended for situations where more aggressive vitamin D repletion is required. Our lower dosage option, Vitamin D Synergy (2,000 IU\/serving), should be considered for maintaining optimal blood levels of vitamin D for long-term supplementation. Vitamin D Ultra 10K also includes vitamin K in both K1 and the MK-7 form of K2, which is highly bioavailable. Both of these forms of vitamin K are important to our health: vitamin K1 (the naturally occurring form of vitamin K in vegetables) and vitamin K2 as MK-7, which is a product of soy fermentation (free of soy allergens) and has the special property of metabolizing slowly throughout the day. Vitamins D and K are essential for optimal bone and arterial health and for maintaining the immune system in proper balance."},{"name":"GastroMend-HP&trade; 60 vegetarian caps","description":"GastroMend-HP is a blend of botanical extracts, all of which support a healthy gastric microbial balance and help maintain a healthy gastric mucosa. This formula may be helpful for occasional heartburn, bloating or upset stomach. "},{"name":"GI Microb-X&trade; 60 vegetarian capsules","description":"GI Microb-X is a blend of botanical extracts with a long history of use for supporting a healthy gastrointestinal microbial balance. The botanical substances in GI Microb-X are commonly represented on sensitivity testing provided by the major functional laboratories performing stool analysis. "},{"name":"GI-Revive&trade; 210 vegetarian capsules","description":null},{"name":"GI-Revive&trade; 225 gm powder","description":null},{"name":"GI-Revive&trade; 450gm Powder","description":null},{"name":"Ginger-Tussin&trade; Syrup 4oz","description":"Ginger-Tussin Syrup is a pleasant-tasting, throat soothing, herbal syrup elixir with immune-supportive properties. It features ginger and the American herb osha for immune support, along with wild cherry bark to soothe the throat and for the occasional cough. The base of this syrup is USP kosher vegetable glycerin, and certified organic honey. "},{"name":"GLA 240 mg 60 softgels","description":null},{"name":"Glucosamine Sulfate 1000mg 180 vegetarian capsules","description":null},{"name":"GlucoSupreme&trade; Herbal 120 capsules","description":"GlucoSupreme Herbal is ideal for supporting healthy insulin and glucose levels. This unique, synergistic formula combines standardized herbs and other botanicals that are shown to support healthy blood sugar through various mechanisms, including cinnamon, corosolic acid from banaba, isoflavones from kudzu, and ginsenosides from ginseng. It also contains Salacia, an ayurvedic herb that supports proper leptin and insulin signaling. "},{"name":"L-Glutamine 850mg 120 vegetarian capsules","description":"L-Glutamine is an amino acid, which is essential for the health of the immune system and the digestive tract. In the gut it promotes the health and function of the mucosal cells for normal healing and repair. L-Glutamine also supports optimal muscle growth and strength and has been shown to be particularly useful in helping to maintain muscle tissue, as it can be used as a substrate for protein synthesis and as an anabolic precursor for muscle growth. "},{"name":"L-Glutamine 250 gm Powder","description":"L-Glutamine is an amino acid, which is essential for the health of the immune system and the digestive tract. In the gut it promotes the health and function of the mucosal cells for normal healing and repair. L-Glutamine also supports optimal muscle growth and strength and has been shown to be particularly useful in helping to maintain muscle tissue, as it can be used as a substrate for protein synthesis and as an anabolic precursor for muscle growth. "},{"name":"L-Glutamine 500 gm Powder","description":"L-Glutamine is an amino acid, which is essential for the health of the immune system and the digestive tract. In the gut it promotes the health and function of the mucosal cells for normal healing and repair. L-Glutamine also supports optimal muscle growth and strength and has been shown to be particularly useful in helping to maintain muscle tissue, as it can be used as a substrate for protein synthesis and as an anabolic precursor for muscle growth. "},{"name":"Glutathione Power&trade; 50 gm powder","description":null},{"name":"GPC 300mg  60caps","description":null},{"name":"GPC Liquid, 2oz","description":null},{"name":"Grape Seed Supreme&trade; 60 vegetarian capsules","description":"Grape Seed Supreme is derived from grape skin and seed extracts and contains protective polyphenols and anthocyanins shown to be beneficial for many aspects of health, including support for blood vessels, brain, and skin. This formula has a unique combination of whole grape extract (similar to a non-alcoholic wine extract), grape skin powder and a special grape seed extract (MegaNatural-BP); all included to help provide the vast array of benefits seen in studies on various grape or wine extracts. "},{"name":"HistaEze&trade; 120 Capsules","description":null},{"name":"Homocysteine Supreme&trade; 60 capsules","description":null},{"name":"Homocysteine Supreme&trade; 120 capsules","description":"Homocysteine Supreme contains synergistic nutrients, including our proprietary NatureFolate blend of active isomer naturally-occurring folates, known to facilitate the efficient metabolism of homocysteine. Homocysteine Supreme maintains a healthy homocysteine pathway, allowing for the normal production of its necessary and important end products. These include the sulfur-containing amino acids taurine and cysteine, and the neurotransmitters norepinephrine and dopamine.* An optimally functioning homocysteine pathway provides methyl and sulfur groups for biochemical reactions such as detoxification, healthy immune function, ideal joint and cartilage structure, and brain and cardiovascular health.*These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease."},{"name":"H-S-N Complex&trade; 120 capsules","description":null},{"name":"HTN Complex&trade; 120 capsules","description":"HTN Complex is a formula created to help maintain normal blood pressure levels. This formula contains nutrients that address these various mechanisms to promote healthy blood pressure. Hawthorne Extract (Crataegus oxyacantha) and Pomegranate (Punica granatum) are important ingredients included for their antioxidant activity, cardioprotective properties and promotion of normal vascular tone."},{"name":"Hydrolyzyme&trade; 60 capsules","description":null},{"name":"Water Ease&trade; 100 vegetarian capsules","description":"Water Ease blends taurine with vitamin B6 to support healthy water balance, blood pressure, and cardiovascular health. This formula is a safe diuretic for occasional water retention. It does not cause mineral depletion or imbalance in the body.*"},{"name":"Weight Loss Support Packets 60 packets","description":null},{"name":"Whey Cool&trade; Chocolate 900g Powder","description":"Whey Cool powder contains the same proprietary non-denatured whey protein concentrate used in PaleoMeal. We do not use cross flow filtration, microfiltration, ultrafiltration, hydrolyzation or ion exchange methods, but instead use a proprietary filtration and drying process. Whey Cool maintains the full range of the fragile immune-boosting and regenerative components naturally present in fresh raw milk and colostrum, such as immunoglobulins, lactoferrins and lactoferricin."},{"name":"Whey Cool&trade; Unflavored 900 gm powder","description":"Whey Cool powder contains the same proprietary non-denatured whey protein concentrate used in PaleoMeal. We do not use cross flow filtration, microfiltration, ultrafiltration, hydrolyzation or ion exchange methods, but instead use a proprietary filtration and drying process. Whey Cool maintains the full range of the fragile immune-boosting and regenerative components naturally present in fresh raw milk and colostrum, such as immunoglobulins, lactoferrins and lactoferricin."},{"name":"Whey Cool&trade; Vanilla 900 gm Powder","description":"Whey Cool powder contains the same proprietary non-denatured whey protein concentrate used in PaleoMeal. We do not use cross flow filtration, microfiltration, ultrafiltration, hydrolyzation or ion exchange methods, but instead use a proprietary filtration and drying process. Whey Cool maintains the full range of the fragile immune-boosting and regenerative components naturally present in fresh raw milk and colostrum, such as immunoglobulins, lactoferrins and lactoferricin."},{"name":"Women&#039;s Twice Daily Essential Packets&trade; (without Iron)","description":"For those women who have normal to high iron ferritin levels or are menopausal, we offer our Women&#039;s Twice Daily Essential Packets without iron. Each packet contains 2 OsteoForce tablets, 2 FemGuard+Balance capsules, 1 Twice Daily Multi capsule, and 1 OmegAvail Synergy softgel."},{"name":"Women&#039;s Twice Daily Essential Packets&trade; (with Iron)","description":"Now women can get all their essential nutrients in this convenient twice daily packet. The Twice Daily Multi helps meet most antioxidant and vitamin and mineral needs. OsteoForce helps support strong, healthy bones. FemGuard + Balance focuses on hormone balance, especially estrogen. OmegAvail Synergy offers all the benefits of omega-3 oils in a highly absorbable form. Ferrochel adds Albion chelated iron for women who are menstruating.Each packet contains 2 OsteoForce tablets, 2 FemGuard+Balance capsules, 1 Twice Daily Multi capsule, 1 OmegAvail Synergy softgel, and 1 Ferrochel Iron Chelate capsule"},{"name":"XanthOmega&trade; Krill Oil 60 softgels","description":"XanthOmega Krill Oil provides a generous 12 mg per serving of the powerful antioxidant astaxanthin to help achieve optimum benefits from this potent carotenoid. It would take eight conventional krill softgels to equal the astaxanthin levels in just one XanthOmega softgel! XanthOmega Krill Oil has a high phospholipid content, standardized to a minimum of 40% phospholipids, mostly as phosphatidylcholine. This updated version is considered to be a virgin krill oil -the purest form available. It contains higher phospholipid bioavailability, which enhances the absorption of the powerful antioxidant astaxanthin. Many studies suggest that this exceptionally high level of astaxanthin offers an array of benefits, which may include powerful antioxidant properties, cardiovascular health, sports performance, eye support, skin health, anti-inflammatory and gastric health support."},{"name":"XanthOmega&trade; Krill Oil 120 softgels","description":"XanthOmega Krill Oil provides a generous 12 mg per serving of the powerful antioxidant astaxanthin to help achieve optimum benefits from this potent carotenoid. It would take eight conventional krill softgels to equal the astaxanthin levels in just one XanthOmega softgel! XanthOmega Krill Oil has a high phospholipid content, standardized to a minimum of 40% phospholipids, mostly as phosphatidylcholine. This updated version is considered to be a virgin krill oil -the purest form available. It contains higher phospholipid bioavailability, which enhances the absorption of the powerful antioxidant astaxanthin. Many studies suggest that this exceptionally high level of astaxanthin offers an array of benefits, which may include powerful antioxidant properties, cardiovascular health, sports performance, eye support, skin health, anti-inflammatory and gastric health support."},{"name":"Xylitol 500g Powder","description":"Xylitol is a safe and natural sweetener that comes from birch tree bark and corn husks. Though it tastes like sugar, it contains 40 percent less calories and does not raise insulin or blood sugar levels, nor does it feed intestinal yeast.* Xylitol makes a perfect sugar alternative for diabetics, low-carbohydrate dieters, heart disease patients, and anyone who wants to avoid sugar and artificial sweeteners. While other xylitol products may contain fillers (such as ingredients to provide bulk), this product contains pure xylitol."},{"name":"IB Synergy&trade;, 60 capsules","description":null},{"name":"Immune Support Packets 30 packets","description":"These packets contain a comprehensive arsenal of immune-supportive nutrients, helping the body maintain a strong defense. Products that comprise these packets include Immunitone Plus, Vitamin D Complex, Stellar C, Zinc Supreme, Tegricel Colostrum and N-Acetyl Cysteine. All were selected for their abilities to support the bodys overall immune response."},{"name":"Immunitone Plus&trade; 90 capsules","description":"Immunitone Plus is an herbal formula that is designed to support healthy immune system function during cold and flu season. It contains herbs that support normal natural killer (NK) cell activity and the balance of cytokines, which are the regulatory proteins released by immune cells as part of a normal immune system response.* The standardized herbs in this formula contain optimal and consistent amounts of the most active ingredients. Immunitone Plus is suitable for long term use and for all age groups."},{"name":"ImmunoBerry&trade; Liquid, 4 oz","description":"ImmunoBerry Liquid provides immune support in a pleasant tasting liquid. Research suggests that certain herbs, mushrooms and other natural compounds have the ability to support normal immune functions such as natural killer (NK) cell activity, cytokine synthesis and the T-cell and B-cell mediated responses. The ingredients such as Elderberry, Shiitake and Wild Cherry Bark are known for their beneficial effects for maintaining a healthy immune system. ImmunoBerry Liquid is sweetened with glycerine and tastes great, and is ideal for both children and adults."},{"name":"ImmunoMod-A&trade; 120 capsules","description":"ImmunoMod-A has been formulated to help balance a healthy inflammatory response, which is necessary in order to help maintain optimal immune function in the body. It features ParActin, an extract of the herb Andrographis paniculata, which has been shown to modulate immune, inflammatory and oxidative pathways. This product also contains the monosaccharide n-acetyl glucosamine along with curcumin, a polyphenolic compound extract from the spice turmeric. Both of these compounds help to support a healthy inflammatory response. "},{"name":"Inflammatone&trade; 60 capsules","description":"Inflammatone is a combination of herbs, nutrients and proteolytic enzymes for modulating the inflammatory response, supporting the natural clearance of proteins like kinin and fibrin, and for supporting healthy lymphatic drainage. The ingredients in Inflammatone provide natural anti-inflammatory effects and protect against oxidative stress."},{"name":"Inflammatone&trade; 120 capsules","description":"Inflammatone is a combination of herbs, nutrients and proteolytic enzymes for modulating the inflammatory response, supporting the natural clearance of proteins like kinin and fibrin, and for supporting healthy lymphatic drainage. The ingredients in Inflammatone provide natural anti-inflammatory effects and protect against oxidative stress."},{"name":"Inflammatone&trade; 240 capsules","description":"Inflammatone is a combination of herbs, nutrients and proteolytic enzymes for modulating the inflammatory response, supporting the natural clearance of proteins like kinin and fibrin, and for supporting healthy lymphatic drainage. The ingredients in Inflammatone provide natural anti-inflammatory effects and protect against oxidative stress."},{"name":"Inositol 100 gm Powder","description":"Inositol supports overall relaxation and helps maintain the proper metabolism of serotonin. It is used for nutritional support of brain wellness and female hormonal health through its role in healthy liver function. It may also aid in attaining a restful nights sleep."},{"name":"Inositol Capsules 900mg 120 capsules","description":"Inositol supports overall relaxation and helps maintain the proper metabolism of serotonin. It is used for nutritional support of brain wellness and female hormonal health through its role in healthy liver function. It may also aid in attaining a restful nights sleep."},{"name":"Inositol 250g powder","description":"Inositol supports overall relaxation and helps maintain the proper metabolism of serotonin. It is used for nutritional support of brain wellness and female hormonal health through its role in healthy liver function. It may also aid in attaining a restful nights sleep."},{"name":"Insomnitol&trade; 60 capsules","description":"Insomnitol is a blend of botanicals, nutrients, and neurotransmitter precursors designed to support quality, restful sleep. By providing nutritional support for calm brain activity, Insomnitol helps promote the natural ability to fall asleep and stay asleep. Key ingredients include botanicals that support nervous system function, PharmaGABA (a proprietary form of GABA), L-theanine, melatonin, 5-HTP, and pyridoxal-5-phospate (activated form of vitamin B6)."},{"name":"Iodine Synergy&trade; 120 vegetarian capsules","description":"Iodine Synergy contains potassium iodide for supporting normal thyroid function, including balanced production of thyroid hormones and the health of breast and prostate tissue. Potassium iodide is a weak salt and easily splits apart in the gut, leaving free iodide ions to join together forming I2 Iodine. The selenium in this product works synergistically with iodine to support the normal conversion of T4 into T3, and supplies antioxidant protection to the thyroid gland."},{"name":"Zinc Challenge 8 oz Liquid","description":"Zinc Challenge provides highly absorbable supplemental zinc (as zinc sulfate monohydrate) in a convenient liquid form in order to help increase the bodys level of this important mineral. Zinc Challenge is stored in an opaque, non-reactive container to preserve the products integrity."},{"name":"Zinc Supreme&trade; 90 vegetarian capsules","description":"Zinc Supreme offers chelated minerals by Albion Advanced Nutrition, the leader in mineral technology. The zinc is zinc bis-glycinate chelate and the molybdenum is bis-glycinate chelate. These are ideal chelates with a 2:1 molar ratio of two amino acids of glycine chemically bonded in liquid to one mineral ion of zinc or molybdenum for optimal absorption. These minerals are combined with other nutrients like vitamins B6 and taurine to provide superior results."},{"name":"K+2 Potassium&trade; 300mg 120 vegetarian capsules","description":"K+2 Potassium is a uniquely formulated potassium product composed of potassium bicarbonate and potassium bound to the amino acid glycine, which gives the product optimum potency, stability and tolerability. This alkalinizing formula provides nutritional support to help maintain healthy blood pressure levels."},{"name":"Kidney Korrect&trade;, 60 capsules","description":"The ingredients in Kidney Korrect have been shown to support healthy kidney function. Champex, a patented extract from Agaricus bisporus, the common white button mushroom, has been shown to help the body maintain a healthy ratio of creatinine in the blood versus the urine. Red ginseng, a specially processed form of Panax ginseng, also supports healthy kidney function and displays kidney-protective, anti-inflammatory and antioxidative properties. Astragalus provides support for healthy fasting glucose levels, along with healthy albumin levels in the urine."},{"name":"KreAlkalyn Pro&trade; 60 vegetarian capsules","description":"With KreAlkalyn Pro, which contains an impressive 900 mg of buffered creatine monohydrate per capsule, only 1 or 2 capsules per day are required. Many of the unpleasant side effects of high-dose creatine supplementation (i.e., nausea, diarrhea, cramps and bloating) are not from the creatine, but from the waste metabolite creatinine. Since Kre-Alkalyn is the only creatine with a pH above 12 it will not convert to creatinine in liquids, including the bloodstream. This results in less of the aforementioned side effects and more creatine delivered to the muscle and other tissues. This means better results at much lower doses (no more loading) when compared with regular creatine powder.* *Kre-Alkalyn is an approved supplement by the International Olympic Committee."},{"name":"L-5-MTHF 5 mg 60 capsules","description":null},{"name":"L-5-MTHF 120 capsules","description":"L-5-MTHF provides the all-natural form of folate. Folate is  essential for cell division and growth, and also works to balance the  homocysteine pathway. This formula provides 1000 mcg per capsule of folate in  the bioidentical, bioactive form, 5-methyltetrahydrofolate. L-5-MTHF (the L  signifying that it is the all-natural [6S] isomer) is the active circulating  form of folate found in the body and one of the several forms found in food. In  nature it is found only as this [6S] isomer, which is why DFH uses L-5-MTHF,  the natural isomer, rather than the mixed (or racemic) form. Our L-5-MTHF uses  the patented folate derivative  Quatrefolic. This innovative form  of folate has demonstrated high bioavailability and solubility as well as long  lasting stability. Quatrefolic L-5-MTHF helps  to increase blood folate levels much better than folic acid. "},{"name":"LibidoStim-F&trade; 60 capsules","description":"LibidoStim-F is a blend of nutraceutical and herbal ingredients for supporting healthy female sexual desire and pleasure. The combination of ingredients in LibidoStim-F promotes healthy metabolism of testosterone and estrogen, and normal blood flow and adrenal function.*"},{"name":"LibidoStim-M&trade; 60 Capsules","description":"LibidoStim-M features the herb Tongkat ali (Eurycoma longifolia), which boasts a variety of published clinical trials touting its effectiveness. This ingredient helps maintain normal testosterone levels which are important for supporting sexual desire and fertility (sperm concentration\/motility), as well as mood and energy. The combination of Tongkat ali with DIM, and additional botanicals in LibidoStim-M provides safe support for normal testosterone production, erectile function, and desire.*"},{"name":"Lipoic Acid Supreme 60 vegetarian capsules","description":"This very powerful supplement contains 300 mg of lipoic acid, along with 4 mg of pure biotin and 500 mg of taurine. Research shows that lipoic acid competes for biotin-dependent enzymes. Long term supplementation of lipoic acid may reduce biotin levels, so it is recommended to supply them together. Taurine and biotin play important roles in maintaining healthy insulin function.*"},{"name":"Lipotrienols RYR&trade; 60 capsules","description":null},{"name":"Lithium Synergy 120 capsules","description":null},{"name":"LV-GB Complex&trade; 90 vegetarian capsules","description":"LV-GB Complex is a comprehensive formula designed to support bile flow for the normal processing and elimination of toxins through the specific combination of nutrients and herbs in this formula. By supporting liver and gallbladder function, LV-GB Complex supports the elimination of fatty substances from the liver and the digestion and assimilation of fats and fat soluble vitamins.*"},{"name":"L-Lysine 120 vegetarian capsules","description":"Lysine is an essential amino acid necessary for growth and tissue repair, and serves a role in the normal production of antibodies, hormones, and enzymes. Lysine is also a precursor of L-carnitine, an amino acid needed for the normal metabolism of fatty acids for energy production in the body."},{"name":"Cardio NRG 12g packet","description":null},{"name":"OncoEase C3G&trade;","description":null},{"name":"MagCitrate Powder 240 Grams","description":"MagCitrate Powder provides 300 mg of magnesium in each one teaspoon serving - a convenient delivery system in a great-tasting lemon flavored powder. It mixes well in water and is very easy to titrate when higher doses are needed. MagCitrate Powder helps promote bowel relaxation when fiber alone is not enough. This product also supports the ability to fall asleep, and can be taken along with our Inositol powder for a restful nights sleep."},{"name":"MagneGel&trade; Transdermal Magnesium Gel, 8 oz","description":"MagneGel, our transdermal magnesium gel, is a pure, 100% natural solution of magnesium chloride. This primary ingredient comes from high quality magnesium salt derived from the depths of the earths interior  all from the ancient Zechstein seabed in Europe.Ultra-pure and untouched by pollutants, this magnesium salt was protected at depths of 5,000-6,500 feet in the Zechstein seabed for the past 250 million years. This transdermal delivery system is highly efficient, allowing for rapid assimilation in the body."},{"name":"Magnesium Glycinate Chelate 120 vegetarian capsules","description":"Magnesium Glycinate Chelate is one of the best absorbed forms of magnesium. Each capsule provides 150 mg of elemental magnesium. This product should not cause any of the unfavorable gastrointestinal symptoms associated with magnesium supplementation due to the very stable chelate formed between two glycine molecules and each magnesium ion via a patented process."},{"name":"Magnesium Glycinate Chelate 240 vegetarian capsules","description":"Magnesium Glycinate Chelate is one of the best absorbed forms of magnesium. Each capsule provides 150 mg of elemental magnesium. This product should not cause any of the unfavorable gastrointestinal symptoms associated with magnesium supplementation due to the very stable chelate formed between two glycine molecules and each magnesium ion via a patented process."},{"name":"Magnesium Malate 120 tablets","description":"Magnesium Malate contains two superior forms of magnesium, one fully chelated to glycine and the other bound to malic acid, which gives this formula excellent absorption and health-promoting properties. Malic acid is found naturally in apples and other fruits and vegetables. This organic mineral acid complex is included because of malic acids role in the Krebs cycle, which may help support energy production. Glycine, which is found in foods and is synthesized by the body, aids in the normal absorption of minerals. Glycine is also of low molecular weight, making it ideal for chelating and absorbing magnesium. The unique properties of this magnesium formula allow for greater absorption and tolerability than non-bound magnesium salts available on the market."},{"name":"Magnesium Malate 240 tablets","description":"Magnesium Malate contains two superior forms of magnesium, one fully chelated to glycine and the other bound to malic acid, which gives this formula excellent absorption and health-promoting properties. Malic acid is found naturally in apples and other fruits and vegetables. This organic mineral acid complex is included because of malic acids role in the Krebs cycle, which may help support energy production. Glycine, which is found in foods and is synthesized by the body, aids in the normal absorption of minerals. Glycine is also of low molecular weight, making it ideal for chelating and absorbing magnesium. The unique properties of this magnesium formula allow for greater absorption and tolerability than non-bound magnesium salts available on the market."},{"name":"MCT Colada&trade; 16 oz liquid","description":"MCT Colada contains emulsified medium-chain triglycerides (MCTs) with a great-tasting natural pineapple\/coconut flavor. Its emulsification allows for unparalleled absorption, and it will completely disperse when mixed into any liquid. Medium-chain triglycerides are a unique form of fat requiring less energy and enzymes in order to be digested into its derivatives, medium chain fatty acids (MCFA) and monoglycerides. MCTs have some very impressive health benefits, which may include support for cognitive health, athletes (fuel for intense exercise), and metabolic function."},{"name":"Melatonin 3 mg 60 tablets","description":"Melatonin is secreted by the pineal gland. As a supplement, it is useful for regulating sleep and the bodys daily rhythmic cycle, making it ideal for jet lag. Melatonin is also an important antioxidant which acts as an effective scavenger of free radicals. Various factors may cause melatonin levels to become low, such as inadequate dietary intake of its precursors (tryptophan and serotonin), normal aging, insufficient exposure to natural light, and certain medications. Melatonin may support a healthy immune and stress response."},{"name":"Metabolic Synergy&trade; 180 vegetarian capsules","description":"A nationally prominent medical doctor specializing in blood sugar and endocrine health designed this multivitamin and mineral formula. Metabolic Synergy helps maintain healthy glucose and insulin levels, while supporting the conversion of carbohydrates to be used for energy by providing nutrients for the TCA cycle. The magnesium, chromium, zinc, manganese, and vanadium are true chelates from Albion, the leader in the manufacture of mineral chelates with superior absorption. It also includes our proprietary NatureFolate blend of active-isomer naturally occurring folates."},{"name":"Metabolic Synergy&trade; 360 vegetarian capsules","description":"A nationally prominent medical doctor specializing in blood sugar and endocrine health designed this multivitamin and mineral formula. Metabolic Synergy helps maintain healthy glucose and insulin levels, while supporting the conversion of carbohydrates to be used for energy by providing nutrients for the TCA cycle. The magnesium, chromium, zinc, manganese, and vanadium are true chelates from Albion, the leader in the manufacture of mineral chelates with superior absorption. It also includes our proprietary NatureFolate blend of active-isomer naturally occurring folates."},{"name":"Metal-X-Synergy&trade;, 90 capsules per bottle","description":"Metal-X-Synergy is designed to help support the normal process of heavy metal detox from the body. It contains a wide array of ingredients, which work together to reduce the initial absorption of metals into the tissues and organs, pull them out more effectively, and help to decrease their reabsorption through enterohepatic recirculation. Metal-X-Synergy contains patented complexes of modified citrus pectin (PectaSol-C) and alginate (Algimate), two complex polysaccharides that work together to bind to heavy metals without depleting essential minerals from the body. Consider combining this formula with Hepatatone Plus, Amino D-Tox and\/or PaleoCleanse for liver and detoxification support."},{"name":"Migranol&trade; 90 vegetarian capsules","description":"Migranol contains an extract of feverfew, a traditional herb known for its anti-inflammatory properties that has been used since the first century. Curcuminoids and rosemary are also included for their antioxidant and anti-inflammatory properties. Magnesium is added for its effects on muscle relaxation. This product may be used long-term with complete safety."},{"name":"Milk Thistle 90 vegetarian capsules","description":"Milk Thistle is an effective herb for detoxifying the liver by promoting the flow of bile and protecting hepatocytes. Designs for Health&#039;s Milk Thistle is standardized to 80% silymarin. Milk thistle may protect the liver from the normal and inevitable exposure to toxins. The inclusion of lecithin provides improved absorption and additional lipotrophic liver support."},{"name":"Mitochondrial NRG&trade; 120 capsules","description":"Mitochondrial NRG is a formulary blend of nutrients, nutraceuticals, botanicals, and Krebs cycle intermediates designed to support efficient mitochondrial metabolism and energy (ATP) production for increased vitality.* Mitochondrial NRG was designed to support the function of the mitochondria, the powerhouse of the cell. This formula may be appropriate for anyone wishing to promote overall cellular and tissue vitality and health, including those wanting to increase energy out put for athletic performance."},{"name":"Mito-PQQ&trade;, 60 capsules","description":"Mito-PQQ is designed to help support optimal mitochondrial biogenesis, which is critical for the promotion of healthy aging, optimal energy production, and protection from reactive oxygen species (oxidative stress). Mito-PQQ features pyrroloquinoline quinone (PQQ), a water-soluble, vitamin-like compound, and Rhodiola rosea, a popular adaptogen. PQQ is an enzyme cofactor possessing antioxidative, neuroprotective, and cardioprotective properties that encourage mitochondrial biogenesis. Rhodiola rosea helps support the adrenal glands. Research shows that Rhodiola rosea is a powerful herb for enhancing mitochondrial energy production and helps defend against free radicals in the nervous system as well as the mitochondria."},{"name":"MSM 1000 mg 90 vegetarian capsules","description":"MSM capsules and powder contain the sulfur-supplying compound methylsulfonylmethane (MSM). MSM modulates histamine release and inflammation, and has the ability to support collagen production, which is the primary constituent of cartilage, skin and connective tissue."},{"name":"MSM 1000 mg 240 vegetarian capsules","description":"MSM capsules and powder contain the sulfur-supplying compound methylsulfonylmethane (MSM). MSM modulates histamine release and inflammation, and has the ability to support collagen production, which is the primary constituent of cartilage, skin and connective tissue."},{"name":"MSM 400 gm Powder","description":"MSM capsules and powder contain the sulfur-supplying compound methylsulfonylmethane (MSM). MSM modulates histamine release and inflammation, and has the ability to support collagen production, which is the primary constituent of cartilage, skin and connective tissue."},{"name":"Ultra Lemon MSM, 450 grams","description":"MSM capsules and powder contain the sulfur-supplying compound methylsulfonylmethane (MSM). MSM modulates histamine release and inflammation, and has the ability to support collagen production, which is the primary constituent of cartilage, skin and connective tissue."},{"name":"MyoSedate&trade; 120 capsules","description":"MyoSedate is a blend of calming herbs and minerals designed to support healthy muscle relaxation. MyoSedate contains valerian root, passion flower and skullcap, which may promote quality sleep without causing drowsiness or sleep-hangover. The addition of Albion chelated minerals involved in muscle contraction and relaxation responses provide further comprehensive support for muscle relaxation."},{"name":"N-Acetyl Cysteine 120 vegetarian capsules","description":"N-Acetyl Cysteine (NAC) is an amino acid that is a precursor to glutathione, the bodys most powerful antioxidant, and helps promote optimal detoxification. NAC is heavily researched for its role in optimizing lung health, and is also used for rapid recovery after workouts. It is also beneficial for protection against normal exposure to heavy metals."},{"name":"Natto-Serrazime&reg; 120 capsules","description":null},{"name":"NeuroCalm&trade; 60 capsules","description":"NeuroCalm is designed to promote activity of GABA and serotonin, which may help support healthy mood, cravings, and feelings of calm, satiety, and satisfaction.* NeuroCalm contains PharmaGABA, a form of GABA naturally manufactured via a fermentation process, which is considered more effective than chemically produced synthetic forms. Support for the production of calming neurotransmitters is also provided by L-theanine and taurine."},{"name":"Neurolink&trade; 180 vegetarian capsules","description":"Neurolink is an encapsulated formula used to support neurological, cognitive and neurotransmitter (serotonin, dopamine, GABA, etc.) function through the inclusion of neurotransmitter precursors and supportive nutrients."},{"name":"NeuroMag&trade; 90 capsules","description":"Several studies indicate that synaptic connections in the brain hippocampus, a critical brain region for learning and memory, decline during the normal process of aging. NeuroMag, which uses the unique, patented, chelated mineral Magtein, contains magnesium which is chelated to threonic acid (magnesium L-threonate). It is superior to other forms of magnesium at getting through the blood brain barrier because it is able to transport magnesium ions across lipid membranes, including those of brain cells. Researchers at MIT concluded that elevating brain magnesium content via supplementation with Magtein may be a useful strategy to support cognitive abilities and decrease common age-related memory decline."},{"name":"Niacin CRT&trade; 500mg 60 tablets","description":"Niacin CRT is a unique wax-matrix tablet, which utilizes the latest Controlled Release Technology (CRT) technology. This technology delivers niacin in a continuous, controlled rate over a 6-8 hour period, throughout the tablets transit time in the bowel. Flushing sometimes happens with time-release niacin, as there can be fairly large surges of niacin released intermittently. However, flushing is less likely with controlled release niacin. This product is available in 500 mg and 750 mg tablets, with this new higher dosage of 750 mg being more convenient for those with a greater need for lipid management."},{"name":"Niacin CRT&trade; 750mg 60 tablets","description":"Niacin CRT is a unique wax-matrix tablet, which utilizes the latest Controlled Release Technology (CRT) technology. This technology delivers niacin in a continuous, controlled rate over a 6-8 hour period, throughout the tablets transit time in the bowel. Flushing sometimes happens with time-release niacin, as there can be fairly large surges of niacin released intermittently. However, flushing is less likely with controlled release niacin. This product is available in 500 mg and 750 mg tablets, with this new higher dosage of 750 mg being more convenient for those with a greater need for lipid management."}]